Revit 2027 API
VertexPositionColored.SetColor Method
 Sets the vertex's color.
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetColor(
	ColorWithTransparency color
)
Public Sub SetColor (
	color As ColorWithTransparency
)
public:
void SetColor(
	ColorWithTransparency^ color
)
member SetColor :
        color : ColorWithTransparency -> unit
Parameters
color ColorWithTransparency
 The vertex's color.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
VertexPositionColored Class
Autodesk.Revit.DB.DirectContext3D Namespace